devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(I2C, void *device_handle, struct vfs_dev_stat *device_stat)
{
        I2C_dev_t *hdl = device_handle;

        device_stat->st_size  = 0;
        device_stat->st_major = hdl->config->major;
        device_stat->st_minor = hdl->config->minor;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief  Function release all resource allocated during initialization phase
 * @param  major         major device number
 * @return None
 */
//==============================================================================
static void release_resources(u8_t major)
{
        if (I2C->periph[major].dev_cnt == 0 && I2C->periph[major].lock) {
                _sys_mutex_delete(I2C->periph[major].lock);
                I2C->periph[major].lock = NULL;
        }

        if (I2C->periph[major].dev_cnt == 0 && I2C->periph[major].event) {
                _sys_semaphore_delete(I2C->periph[major].event);
                I2C->periph[major].event = NULL;
        }

        if (I2C->periph[major].dev_cnt == 0 && I2C->periph[major].initialized) {
                disable_I2C(major);
        }

        bool mem_used = false;
        for (int i = 0; i < _I2C_NUMBER_OF_PERIPHERALS && !mem_used; i++) {
                mem_used = I2C->periph[i].dev_cnt > 0;
        }

        if (!mem_used && I2C) {
                free(I2C);
                I2C = NULL;
        }
}

//==============================================================================
/**
 * @brief  Returns I2C address of current device
 * @param  hdl          device handle
 * @return I2C peripheral address
 */
//==============================================================================
static inline I2C_t *get_I2C(I2C_dev_t *hdl)
{
        return const_cast(I2C_t*, I2C_cfg[hdl->config->major].I2C);
}

//==============================================================================
/**
 * @brief  Clear all DMA IRQ flags (of tx and rx)
 * @param  major        peripheral major number
 * @return None
 */
//==============================================================================
#if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
static void clear_DMA_IRQ_flags(u8_t major)
{
        I2C_config_t  *cfg    = const_cast(I2C_config_t*, &I2C_cfg[major]);
        DMA_Channel_t *DMA_tx = const_cast(DMA_Channel_t*, cfg->DMA_tx);
        DMA_Channel_t *DMA_rx = const_cast(DMA_Channel_t*, cfg->DMA_rx);

        WRITE_REG(DMA1->IFCR, (DMA_IFCR_CGIF1  << (4 * (cfg->DMA_tx_number - 1)))
                            | (DMA_IFCR_CTCIF1 << (4 * (cfg->DMA_tx_number - 1)))
                            | (DMA_IFCR_CHTIF1 << (4 * (cfg->DMA_tx_number - 1)))
                            | (DMA_IFCR_CTEIF1 << (4 * (cfg->DMA_tx_number - 1)))
                            | (DMA_IFCR_CGIF1  << (4 * (cfg->DMA_rx_number - 1)))
                            | (DMA_IFCR_CTCIF1 << (4 * (cfg->DMA_rx_number - 1)))
                            | (DMA_IFCR_CHTIF1 << (4 * (cfg->DMA_rx_number - 1)))
                            | (DMA_IFCR_CTEIF1 << (4 * (cfg->DMA_rx_number - 1))) );

        CLEAR_BIT(DMA_tx->CCR, DMA_CCR1_EN);
        CLEAR_BIT(DMA_rx->CCR, DMA_CCR1_EN);
}
#endif

//==============================================================================
/**
 * @brief  Enables selected I2C peripheral according with configuration
 * @param  major        peripheral number
 * @return On success true is returned, otherwise false and appropriate error is set
 */
//==============================================================================
static bool enable_I2C(u8_t major)
{
        const I2C_config_t *cfg = &I2C_cfg[major];
        I2C_t              *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        SET_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);

        RCC_ClocksTypeDef clocks;
        memset(&clocks, 0, sizeof(RCC_ClocksTypeDef));
        RCC_GetClocksFreq(&clocks);
        clocks.PCLK1_Frequency /= 1000000;

        if (clocks.PCLK1_Frequency < 2) {
                errno = EIO;
                return false;
        }

        u16_t CR2 = (clocks.PCLK1_Frequency) & I2C_CR2_FREQ;

        #if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
        if (cfg->use_DMA) {
                if ((cfg->DMA_rx->CCR & DMA_CCR1_EN) || (cfg->DMA_tx->CCR & DMA_CCR1_EN)) {
                        errno = EADDRINUSE;
                        return false;
                } else {
                        SET_BIT(RCC->AHBENR, RCC_AHBENR_DMA1EN);

                        clear_DMA_IRQ_flags(major);

                        NVIC_EnableIRQ(cfg->DMA_tx_IRQ_n);
                        NVIC_EnableIRQ(cfg->DMA_rx_IRQ_n);
                        NVIC_SetPriority(cfg->DMA_tx_IRQ_n, cfg->IRQ_prio);
                        NVIC_SetPriority(cfg->DMA_rx_IRQ_n, cfg->IRQ_prio);
                }
        }
        #endif

        NVIC_EnableIRQ(cfg->IRQ_EV_n);
        NVIC_EnableIRQ(cfg->IRQ_ER_n);
        NVIC_SetPriority(cfg->IRQ_EV_n, cfg->IRQ_prio);
        NVIC_SetPriority(cfg->IRQ_ER_n, cfg->IRQ_prio);

        u16_t CCR;
        if (cfg->freq <= 100000) {
                CCR = ((1000000/(2 * cfg->freq)) * clocks.PCLK1_Frequency) & I2C_CCR_CCR;
        } else if (cfg->freq < 400000){
                CCR  = ((10000000/(3 * cfg->freq)) * clocks.PCLK1_Frequency / 10) & I2C_CCR_CCR;
                CCR |= I2C_CCR_FS;
        } else {
                CCR  = ((100000000/(25 * cfg->freq)) * clocks.PCLK1_Frequency / 100 + 1) & I2C_CCR_CCR;
                CCR |= I2C_CCR_FS | I2C_CCR_DUTY;
        }

        i2c->CR1   = I2C_CR1_SWRST;
        i2c->CR1   = 0;
        i2c->CR2   = CR2;
        i2c->CCR   = CCR;
        i2c->TRISE = clocks.PCLK1_Frequency + 1;
        i2c->CR1   = I2C_CR1_PE;

