devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
                        SET_BIT(i2c->CR2, I2C_CR2_ITBUFEN);

                } else {
                        error();
                }
                break;

        case STATE_SUB_ADDRESS:
                if (i2c->SR1 & I2C_SR1_TXE) {

                        switch (per->sub_addr_mode) {
                        case I2C_SUB_ADDR_MODE__3_BYTES:
                                i2c->DR = per->sub_addr >> 16;
                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__2_BYTES;
                                break;

                        case I2C_SUB_ADDR_MODE__2_BYTES:
                                i2c->DR = per->sub_addr >> 8;
                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__1_BYTE;
                                break;

                        case I2C_SUB_ADDR_MODE__1_BYTE:
                                i2c->DR = per->sub_addr;
                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
                                per->state = STATE_TRANSFER;
                                break;
                        default:
                                per->state = STATE_TRANSFER;
                        }

                } else {
                        error();
                }
                break;

        case STATE_TRANSFER:
                if (!per->data || !per->data_size) {
                        finish();

                } else {
                        if (cfg->use_DMA) {
                                #if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
                                DMA_Channel_t *DMA = const_cast(DMA_Channel_t*, per->write ? cfg->DMA_tx : cfg->DMA_rx);

                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_ITEVTEN);
                                WRITE_REG(i2c->SR1, 0);

                                DMA->CPAR  = reinterpret_cast(u32_t, &i2c->DR);
                                DMA->CMAR  = reinterpret_cast(u32_t, per->data);
                                DMA->CNDTR = per->data_size;
                                DMA->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_TEIE | (per->write ? DMA_CCR1_DIR : 0);

                                SET_BIT(i2c->CR2, I2C_CR2_DMAEN);

                                if (per->stop) {
                                        SET_BIT(i2c->CR2, I2C_CR2_LAST);
                                } else {
                                        CLEAR_BIT(i2c->CR2, I2C_CR2_LAST);
                                }

                                SET_BIT(DMA->CCR, DMA_CCR1_EN);
                                #endif
                        } else {
                                if ((i2c->SR1 & I2C_SR1_TXE) && (i2c->SR2 & I2C_SR2_TRA)) {

                                        i2c->DR = *(per->data++);

                                        if (--per->data_size == 0) {
                                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN);
                                        }

                                } else if ((i2c->SR1 & I2C_SR1_RXNE) && !(i2c->SR2 & I2C_SR2_TRA)) {

                                        if (per->data_size == 2) {
                                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                                SET_BIT(i2c->CR1, I2C_CR1_STOP);
                                        } else if (per->data_size <= 1) {
                                                finish();
                                        }

                                        *(per->data++) = i2c->DR;
                                        per->data_size--;

                                } else {
                                        error();
                                }
                        }
                }

                break;
        }

        return woken;
}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static bool IRQ_ER_handler(u8_t major)
{
        I2C_t *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        I2C->periph[major].addr10rd = false;
        I2C->periph[major].error    = true;
        I2C->periph[major].state    = STATE_IDLE;

        WRITE_REG(i2c->SR1, 0);
        CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
        SET_BIT(i2c->CR1, I2C_CR1_STOP);

        bool woken = false;
        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, &woken);

        return woken;
}

//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
#if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
static bool IRQ_DMA_handler(u8_t major)
{
        bool            woken = false;
        I2C_config_t   *cfg   = const_cast(I2C_config_t*, &I2C_cfg[major]);
        I2C_t          *i2c   = const_cast(I2C_t*, cfg->I2C);
        struct I2C_per *per   = &I2C->periph[major];
        int             txno  = cfg->DMA_tx_number - 1;
        int             rxno  = cfg->DMA_rx_number - 1;

        if (DMA1->ISR & ((DMA_ISR_TCIF1 << (4 * txno)) | (DMA_ISR_TCIF1 << (4 * rxno)))) {

                per->data_size = 0;
                per->addr10rd  = false;
                per->state     = STATE_IDLE;

                if (per->stop)
                        SET_BIT(i2c->CR1, I2C_CR1_STOP);

                _sys_semaphore_signal_from_ISR(I2C->periph[major].event, &woken);

        } else if (DMA1->ISR & ((DMA_ISR_TEIF1 << (4 * txno)) | (DMA_ISR_TEIF1 << (4 * rxno)))) {
                woken = IRQ_ER_handler(major);
        }

